app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"
---
  def index
    @pins = Pin.all